In [1]:
import numpy as np
import matplotlib as mat
import pandas as pd

In [321]:
data=pd.read_excel("ess.xlsx")
#data=pd.read_csv("7004_1.csv",dtype="unicode")
data

     a  v     c     h    d   e   f  essai
0    a  1   sgd   4.0  NaN NaN NaN    NaN
1    a  2  dgdg   5.0  NAN NaN NaN    NaN
2    a  5  dgdg   2.0  NaN NaN NaN    NaN
3   df  8     c  52.5  NaN NaN NaN    NaN
4  fgd  9    gd   2.0    5 NaN NaN    NaN
5  df1  6  dgdg   5.5  NaN NaN NaN    NaN

In [249]:
data.shape

(7, 8)

In [250]:
data.describe()# describtion des colones majorit√©

              v          h    e    f  essai
count  6.000000   6.000000  0.0  0.0    0.0
mean   5.166667  11.833333  NaN  NaN    NaN
std    3.188521  19.976653  NaN  NaN    NaN
min    1.000000   2.000000  NaN  NaN    NaN
25%    2.750000   2.500000  NaN  NaN    NaN
50%    5.500000   4.500000  NaN  NaN    NaN
75%    7.500000   5.375000  NaN  NaN    NaN
max    9.000000  52.500000  NaN  NaN    NaN

In [251]:
#data.quantities.describe()  #
data.shape

(7, 8)

In [252]:
#data.variety.describe() # description de la colone

In [262]:
data.describe(include=['float64'])

              v          h    e    f  essai
count  6.000000   6.000000  0.0  0.0    0.0
mean   5.166667  11.833333  NaN  NaN    NaN
std    3.188521  19.976653  NaN  NaN    NaN
min    1.000000   2.000000  NaN  NaN    NaN
25%    2.750000   2.500000  NaN  NaN    NaN
50%    5.500000   4.500000  NaN  NaN    NaN
75%    7.500000   5.375000  NaN  NaN    NaN
max    9.000000  52.500000  NaN  NaN    NaN

In [263]:
#data.describe(include=np.number)
#data.describe(include=['object']).shape
data.v.describe()

count    6.000000
mean     5.166667
std      3.188521
min      1.000000
25%      2.750000
50%      5.500000
75%      7.500000
max      9.000000
Name: v, dtype: float64

In [264]:
#data.describe(include=[np.number])

In [265]:
data.describe(exclude=[np.number])

        a     c    d
count   6     6    1
unique  4     4    1
top     a  dgdg  NAN
freq    3     3    1

In [258]:
data.dtypes.value_counts()

float64    5
object     3
dtype: int64

In [259]:
data.groupby('a').size() # combient de valeur se r√©petent

a
a      3
df     1
df1    1
fgd    1
dtype: int64

In [329]:
data.isnull()

       a      v      c      h      d     e     f  essai
0  False  False  False  False   True  True  True   True
1  False  False  False  False  False  True  True   True
2  False  False  False  False   True  True  True   True
3  False  False  False  False   True  True  True   True
4  False  False  False  False  False  True  True   True
5  False  False  False  False   True  True  True   True

In [328]:
data.isnull().any() # False contient valeur 
#sion true vide ou null ou NaN

a        False
v        False
c        False
h        False
d         True
e         True
f         True
essai     True
dtype: bool

In [306]:
data.isnull().count() #nb de ligne de chaque colone

a        6
v        6
c        6
h        6
d        6
e        6
f        6
essai    6
dtype: int64

In [325]:
data.isnull().any().count() #nb de colone total

8

In [324]:
#data.isnull().any().describe()
data.isnull().any() # donne true lorsque on  vide ou on a null ou an NaN

a        False
v        False
c        False
h        False
d         True
e         True
f         True
essai     True
dtype: bool

In [292]:
data.shape

(19315, 48)

In [330]:
data.count() # il compte valeur NULL ou vide ou NaN ne les comptes pas

a        6
v        6
c        6
h        6
d        2
e        0
f        0
essai    0
dtype: int64

In [322]:
data.isna().count()

a        6
v        6
c        6
h        6
d        6
e        6
f        6
essai    6
dtype: int64

In [331]:
data.isnull()

       a      v      c      h      d     e     f  essai
0  False  False  False  False   True  True  True   True
1  False  False  False  False  False  True  True   True
2  False  False  False  False   True  True  True   True
3  False  False  False  False   True  True  True   True
4  False  False  False  False  False  True  True   True
5  False  False  False  False   True  True  True   True